Контролируемые счета/example/9_PreBlockAuth.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <ns5:UCBRUHeaders xmlns:ns5="urn:ucbru:gbo:v4" xmlns:ns6="urn:ucbru:gbo:v4:casa">
            <ns5:Correlation>
                <ns5:XRef>5555a998-7779-9999-a85a-b2777744fd88</ns5:XRef>
            </ns5:Correlation>
            <ns5:Audit>
                <ns5:MessagePath>
                    <ns5:Step>
                        <ns5:Application.Module>PAYMENT_HUB</ns5:Application.Module>
                        <ns5:TimeStamp>2016-11-28T12:18:23.490Z</ns5:TimeStamp>
                    </ns5:Step>
                </ns5:MessagePath>
                <ns5:ProcessInfo>
                    <ns5:Name>PAYMENT_HUB</ns5:Name>
                    <ns5:InstanceId>5555888-123-789524-99971</ns5:InstanceId>
                </ns5:ProcessInfo>
            </ns5:Audit>
        </ns5:UCBRUHeaders>
    </soapenv:Header>
    <soapenv:Body>
        <ns2:SCASABlockAmountPreBlockAuthorize xmlns:ns2="urn:ucbru:gbo:v4:casa" xmlns="urn:ucbru:gbo:v4">
            <ns2:Block>
                <ns2:RequestNumber>1</ns2:RequestNumber>
                <ns2:BlockReference>
                    <ns2:SystemCode>PHUB</ns2:SystemCode>
                    <ns2:BlockId>555002</ns2:BlockId>
                </ns2:BlockReference>
                <ns2:CBAccount>30232810200014724287</ns2:CBAccount>
                <ns2:BlockAmountParams>
                    <ns2:BlockAmount>15222</ns2:BlockAmount>
                </ns2:BlockAmountParams>
                <ns2:ObjectReference>555112</ns2:ObjectReference>
                <ns2:ExtModule>PHub1</ns2:ExtModule>
                <ns2:ExtOperationCode>PAY</ns2:ExtOperationCode>
                <ns2:Priority>5</ns2:Priority>
                <ns2:OperationTimestamp>2016-01-25T11:16:35.745Z</ns2:OperationTimestamp>
                <ns2:Narrative>оепебнд опхмършу демефмшу япедярб янцкюямн пееярпнб нр 20150625 он днцнбнпс на хрб нр 27.07.2012. мдя ме накюцюеряъ</ns2:Narrative>
                <ns2:UseOverdraft>true</ns2:UseOverdraft>
                <ns2:IgnoreBalance>false</ns2:IgnoreBalance>
                <ns2:IgnoreBlockFlag>false</ns2:IgnoreBlockFlag>
                <ns2:UseFAFO>false</ns2:UseFAFO>
                <ns2:ABSSpecificParameters>
                    <ns2:MIDASSpecificParameters>
                        <ns2:TransactionType>PH</ns2:TransactionType>
                        <ns2:TransactionNumber/>
                        <ns2:ProjectNarrative>PH555112</ns2:ProjectNarrative>
                    </ns2:MIDASSpecificParameters>
                </ns2:ABSSpecificParameters>
            </ns2:Block>
        </ns2:SCASABlockAmountPreBlockAuthorize>
    </soapenv:Body>
</soapenv:Envelope>